<#GAPDoc Label="LinearNotation">
<ManSection >
<Func Arg="transformation" Name="LinearNotation" />
<Func Arg="transformation" Name="SimplerLinearNotation" />
<Description>
Returns the linear (one-line) notation of the given finite transformation
as a string.
<P></P>
Constant map:
<Example>
gap> LinearNotation(Transformation([1,1,1,1]));
"[2,3,4;1]"
</Example>
Permutation reverts back to the the cyclic notation.
<Example>
gap> LinearNotation(Transformation([2,3,4,1]));
"(1,2,3,4)"
</Example>
1 forms a trivial cycle, 2,3,4 go to 1, 5 goes to 4
<Example>
gap> LinearNotation(Transformation([1,1,2,2,4]));
"[[3,[5;4];2];1]"
</Example>
Permuting  1 and 2 and the other points go to 2
<Example>
gap> LinearNotation(Transformation([2,1,2,2,4]));
"(1,[3,[5;4];2])"
</Example>
However, for constant map we can apply another simplification:
<Example>
gap> SimplerLinearNotation(Transformation([5,5,5,5,5]));
"[->5]"
</Example>
</Description>
</ManSection>
<#/GAPDoc>
